# üîó Pandas: Merge, Join, Concat

## üìå 1. DataSet ‚Äì Hazƒ±rlƒ±q

In [1]:
import pandas as pd

calisanlar = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Isim': ['Ali', 'Ay≈üe', 'Zeynep', 'Murat'],
    'DepartmanID': [101, 102, 101, 103]
})

bolumler = pd.DataFrame({
    'DepartmanID': [101, 102, 104],
    'DepartmanAdi': ['ƒ∞K', 'Finans', 'BT']
})

print(calisanlar)
print(bolumler)

   ID    Isim  DepartmanID
0   1     Ali          101
1   2    Ay≈üe          102
2   3  Zeynep          101
3   4   Murat          103
   DepartmanID DepartmanAdi
0          101           ƒ∞K
1          102       Finans
2          104           BT

## üîÅ 2. `merge()` ‚Äì SQL-vari birle≈üim

In [ ]:
# Inner Join ‚Äì sadece ortusenler alƒ±nƒ±r
pd.merge(calisanlar, bolumler, on='DepartmanID', how='inner')

   ID    Isim  DepartmanID DepartmanAdi
0   1     Ali          101           ƒ∞K
1   2    Ay≈üe          102       Finans
2   3  Zeynep          101           ƒ∞K

In [ ]:
# Left Join ‚Äì sol table qorunur
pd.merge(calisanlar, bolumler, on='DepartmanID', how='left')

   ID    Isim  DepartmanID DepartmanAdi
0   1     Ali          101           ƒ∞K
1   2    Ay≈üe          102       Finans
2   3  Zeynep          101           ƒ∞K
3   4   Murat          103          NaN

In [ ]:
# Right Join ‚Äì saƒü table qorunur
pd.merge(calisanlar, bolumler, on='DepartmanID', how='right')

    ID    Isim  DepartmanID DepartmanAdi
0  1.0     Ali          101           ƒ∞K
1  3.0  Zeynep          101           ƒ∞K
2  2.0    Ay≈üe          102       Finans
3  NaN     NaN          104           BT

In [ ]:
# Outer Join ‚Äì Butun data alƒ±nƒ±r
pd.merge(calisanlar, bolumler, on='DepartmanID', how='outer')

    ID    Isim  DepartmanID DepartmanAdi
0  1.0     Ali          101           ƒ∞K
1  3.0  Zeynep          101           ƒ∞K
2  2.0    Ay≈üe          102       Finans
3  4.0   Murat          103          NaN
4  NaN     NaN          104           BT

## üîó 3. `join()` ‚Äì Index bazlƒ± birle≈üim

In [6]:
ekstra = pd.DataFrame({
    'Maas': [5000, 6000, 5500, 6200]
}, index=[1, 2, 3, 4])

calisanlar.join(ekstra, on='ID')

   ID    Isim  DepartmanID  Maas
0   1     Ali          101  5000
1   2    Ay≈üe          102  6000
2   3  Zeynep          101  5500
3   4   Murat          103  6200

## ‚ûï 4. `concat()` ‚Äì Tabloyu alt alta veya yan yana ekleme

In [7]:
df1 = pd.DataFrame({'A': ['A1', 'A2'], 'B': ['B1', 'B2']})
df2 = pd.DataFrame({'A': ['A3', 'A4'], 'B': ['B3', 'B4']})

# Alt alta
pd.concat([df1, df2])

    A   B
0  A1  B1
1  A2  B2
0  A3  B3
1  A4  B4

In [8]:
# Yan yana (axis=1)
pd.concat([df1, df2], axis=1)

    A   B   A   B
0  A1  B1  A3  B3
1  A2  B2  A4  B4

In [9]:
## üß† Mini G√∂revler

### 1. `calisanlar` ile `bolumler` tablolarƒ±nƒ± outer join ile birle≈ütir.

pd.merge(calisanlar, bolumler, on= "DepartmanID", how= "outer")

    ID    Isim  DepartmanID DepartmanAdi
0  1.0     Ali          101           ƒ∞K
1  3.0  Zeynep          101           ƒ∞K
2  2.0    Ay≈üe          102       Finans
3  4.0   Murat          103          NaN
4  NaN     NaN          104           BT

In [ ]:

### 2. `calisanlar`'a maa≈ü bilgilerini join() ile ekle.
from operator import index
from pandas import DataFrame


maas = DataFrame({
    "Maas" : [3000, 6000, 5500, 4000]
    }, index=[1,2,3,4])
calisanlar.join(maas, on= "ID")

### 3. 3 tabloyu `concat()` ile alt alta ekleyip toplam satƒ±r sayƒ±sƒ±nƒ± hesapla.
new = pd.concat([calisanlar, bolumler, ekstra])
len(new.index)

11